results_petclinic-sim-native/run_3_2026-01-05_03-42-36/FIXED-3000-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 6.856ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.742ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.382ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.547ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.735ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.432ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.567ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.635ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.987ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.241ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.356ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.493ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.684ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.741ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.763ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.743ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.44ms    5.59ms  59.04ms   91.07%
    Req/Sec   191.39     47.75   550.00     78.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.63ms
 75.000%    5.58ms
 90.000%   10.29ms
 99.000%   32.22ms
 99.900%   47.29ms
 99.990%   55.07ms
 99.999%   58.30ms
100.000%   59.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.901     0.000000            1         1.00
       2.151     0.100000         6024         1.11
       2.517     0.200000        12009         1.25
       2.847     0.300000        18001         1.43
       3.201     0.400000        23995         1.67
       3.629     0.500000        29987         2.00
       3.889     0.550000        32983         2.22
       4.187     0.600000        36003         2.50
       4.551     0.650000        39007         2.86
       4.995     0.700000        41989         3.33
       5.583     0.750000        44983         4.00
       5.991     0.775000        46483         4.44
       6.451     0.800000        47973         5.00
       7.063     0.825000        49476         5.71
       7.879     0.850000        50975         6.67
       8.927     0.875000        52484         8.00
       9.567     0.887500        53224         8.89
      10.287     0.900000        53973        10.00
      11.151     0.912500        54720        11.43
      12.279     0.925000        55474        13.33
      13.671     0.937500        56222        16.00
      14.543     0.943750        56596        17.78
      15.551     0.950000        56968        20.00
      16.895     0.956250        57346        22.86
      18.543     0.962500        57718        26.67
      20.623     0.968750        58093        32.00
      21.887     0.971875        58283        35.56
      23.391     0.975000        58467        40.00
      25.007     0.978125        58655        45.71
      26.671     0.981250        58843        53.33
      28.383     0.984375        59032        64.00
      29.295     0.985938        59124        71.11
      30.463     0.987500        59219        80.00
      31.439     0.989062        59312        91.43
      32.719     0.990625        59404       106.67
      34.111     0.992188        59498       128.00
      34.943     0.992969        59545       142.22
      35.807     0.993750        59594       160.00
      36.543     0.994531        59641       182.86
      37.759     0.995313        59686       213.33
      39.071     0.996094        59732       256.00
      39.871     0.996484        59758       284.44
      40.415     0.996875        59779       320.00
      41.279     0.997266        59803       365.71
      42.591     0.997656        59826       426.67
      43.775     0.998047        59849       512.00
      44.159     0.998242        59862       568.89
      44.863     0.998437        59873       640.00
      45.887     0.998633        59885       731.43
      46.655     0.998828        59896       853.33
      47.423     0.999023        59908      1024.00
      48.063     0.999121        59914      1137.78
      48.863     0.999219        59920      1280.00
      49.663     0.999316        59926      1462.86
      50.207     0.999414        59931      1706.67
      51.199     0.999512        59937      2048.00
      51.487     0.999561        59940      2275.56
      51.583     0.999609        59943      2560.00
      51.743     0.999658        59946      2925.71
      52.095     0.999707        59949      3413.33
      52.799     0.999756        59952      4096.00
      52.863     0.999780        59953      4551.11
      53.599     0.999805        59955      5120.00
      54.463     0.999829        59956      5851.43
      54.783     0.999854        59958      6826.67
      55.039     0.999878        59959      8192.00
      55.071     0.999890        59960      9102.22
      55.391     0.999902        59961     10240.00
      55.391     0.999915        59961     11702.86
      55.615     0.999927        59962     13653.33
      55.807     0.999939        59963     16384.00
      55.807     0.999945        59963     18204.44
      57.823     0.999951        59964     20480.00
      57.823     0.999957        59964     23405.71
      57.823     0.999963        59964     27306.67
      58.303     0.999969        59965     32768.00
      58.303     0.999973        59965     36408.89
      58.303     0.999976        59965     40960.00
      58.303     0.999979        59965     46811.43
      58.303     0.999982        59965     54613.33
      59.071     0.999985        59966     65536.00
      59.071     1.000000        59966          inf
#[Mean    =        5.437, StdDeviation   =        5.589]
#[Max     =       59.040, Total count    =        59966]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89992 requests in 30.00s, 134.12MB read
Requests/sec:   3000.04
Transfer/sec:      4.47MB